using UnityEngine;

public class Artifact : MonoBehaviour
{
    public string name; // Назва артефакту
    public int value; // Вартість артефакту в грошах

    // При створенні об'єкту
    void Awake()
    {
        GenerateArtifactData();
    }

    // Генерація нових даних для артефакту зі звичайною вартістю
    public void GenerateArtifactData()
    {
        // Генеруємо випадкову назву та ціну
        name = GenerateRandomName();
        value = Random.Range(5, 120);
    }

    // Генерація артефакту із високою вартістю (від 100 до 200)
    public void GenerateHighValueArtifact()
    {
        name = GenerateRandomName();
        value = Random.Range(100, 201);
    }

    // Випадкова генерація назви
    string GenerateRandomName()
    {
        // Заготовки назв артефактів
        string[] possibleNames = {
    "Смарагдовий обруч",
    "Золотий перстень",
    "Античний медальйон",
    "Срібний ланцюжок",
    "Бісерне намисто",
    "Золота скульптура",
    "Срібний кубок",
    "Перлинний абажур",
    "Золотий кинджал",
    "Сапфіровий обруч",
    "Срібний скарбничка",
    "Кам'яний вазон",
    "Годинник із платиновими стрілками",
    "Гербований золотий ключ",
    "Червоний камінь",
    "Старовинний метелик",
    "Фіалка в кришталевому вазоні",
    "Зламана зірка зі скла",
    "Мармуровий кульчик",
    "Дерев'яна фігурка кота",
    "Латунний шматок з узорами",
    "Глечик із розмальованою квіткою",
    "Аметистовий камінь",
    "Пошкоджений металевий щит",
    "Дитячий чобіток з шнурівкою",
    "Старий класичний книжковий фартук",
    "Спресований глибокий папір",
    "Мала масляна лампа",
    "Дерев'яний ліхтар для свічки",
    "Фрагмент старовинного картону",
    "Порцелянова чашка",
    "Величезний камінь з виїмкою",
    "Старовинний ліхтар для доріг",
    "Чаша з патернами",
    "Глибока старовинна рамка для фотографій",
    "Слід зуба на бронзовій пластинці",
    "Штучний метелик",
    "Старовинний зламаний годинник"
};


        // Випадковим чином вибираємо назву зі списку
        return possibleNames[Random.Range(0, possibleNames.Length)];
    }
}
